In [1]:
import pandas as pd

In [4]:
cars = pd.read_csv('data/cars.csv')

In [6]:
people = pd.read_csv('data/people.csv')

In [5]:
cars.head()

,Name,MPG,Cylinders,Displacement,Horsepower,Weight,Acceleration,Origin
0,Chevrolet Chevelle Malibu,18.0,8,307.0,130,3504,12.0,US
1,Buick Skylark 320,15.0,8,350.0,165,3693,11.5,US
2,Plymouth Satellite,18.0,8,318.0,150,3436,11.0,US
3,AMC Rebel SST,16.0,8,304.0,150,3433,12.0,US
4,Ford Torino,17.0,8,302.0,140,3449,10.5,US

In [7]:
people.head()

     Name  Age  Weight  Height Gender
0    Rita   27      67    1.65      F
1  Dexter   35      81    1.84      M
2    Anna   29      55    1.60      F
3     Bob   41      73    1.79      M

We can access a specific cell of a pandas dataframe using the DataFrame.iloc property by providing the row and column index. The name **iloc stands for integer location**

When we really only want to access a single location, as in the first example, it is recommended to use the **DataFrame.iat** property. It has the same syntax but doesn't allow ranges.

In [8]:
print(people.iat[0, 0])

Rita